{"superheroes":[{"name":"Batman","secretIdentity":"Bruce Wayne","bio":"Dark Knight. Caped Crusader. World’s Greatest Detective. Whatever you know him as, wherever you know him from—the blockbuster movies, TV shows, video games, cartoons, or millions of comics—Batman is proof you don’t need superpowers to be a superhero… and the poster boy for what a bad childhood can do to you.\r\n\r\nMillionaire Bruce Wayne was just a kid when he watched his parents get gunned down during a mugging in Gotham City. The crime would define his life, as he dedicated himself to becoming the world’s greatest weapon against crime—the Batman.\r\n\r\nForget his Batarangs, Batmobile, or Utility Belt filled with high-tech weapons. Batman is the most feared superhero of all, because he’s pushed himself to the absolute pinnacle of human achievement. He’s a brilliant detective who’s mastered fighting techniques the world’s barely heard of. An Olympic-caliber athlete with a plan for every occasion, Batman’s seemingly always five steps ahead of his foes. But in his crusade against injustice, two questions always loom: How far will he go to protect the innocent, and will he sacrifice his humanity along the way?","imgUrl":"https://upload.wikimedia.org/wikipedia/en/2/22/Batman-DC-Comics.jpg","id":"b1f6799b-779a-4cff-925a-c1c14290c1d7"},{"name":"Wonder Woman","secretIdentity":"Diana Prince","bio":"OK, let’s just come out and say it: Wonder Woman is the most famous heroine of all time. No offense to the Lara Crofts, Buffys, or Disney princesses of the world, but none of them have been plastered on as many magazine covers, adorned as many T-shirts, or sold the countless comics, dolls, and action figures that Wonder Woman has. The full package of beauty, brains, and brawn, she’s been a feminist icon since her star-spangled intro in 1941.\r\n\r\nWonder Woman is Princess Diana of the immortal Amazons from Greek mythology.  When army pilot Steve Trevor crashes on the warriors’ secluded island paradise, Diana wins the right to escort him home and make her people known to the world. Entering our cynical world for the first time, there’s a lot she must wrap her head around, especially our ways of war, hate, and, well… dating. Helping her are her superhuman strength and speed, as well as the trademark bulletproof bracelets, but it’s probably her Golden Lasso of Truth most people really wish they had.\r\n\r\nTorn between a mission to promote peace and her own warrior upbringing, Wonder Woman fights evil while hoping to unlock the potential of a humanity she doesn’t always understand.","imgUrl":"http://pre02.deviantart.net/9836/th/pre/i/2013/118/8/4/wonder_woman_by_jeffach-d59egpa.jpg","id":"912b6188-66bc-4b53-9f8e-29050da25b70"},{"name":"Superman","secretIdentity":"Klark Kent","bio":"Look! Up in the sky! It’s a bird! It’s a plane! It’s…Well, you know how it ends, don’t you? It’s a sentence so iconic, there are probably kids shouting it in Swahili as you read this.\r\n\r\nThe most recognized superhero in pop culture, Superman has been elevated to mythic folkhero status. Rocketed to Earth from the dying planet Krypton, baby Kal-El was found by a farming couple who named the boy Clark Kent and raised him as their own. Discovering his enormous powers, they instilled in him strong moral values—and inspired him to become a hero.\r\n\r\nSuperman has super-everything—strength, speed, flight, invulnerability as well as his renowned X-ray and heat vision. The most powerful being on the planet, his amazing abilities are also a melancholy reminder of how different he is from the people he’s dedicated to protect. \r\n\r\nA universal icon, Superman means different things to the many diverse people he inspires: He’s an alien; an immigrant from a faraway land just looking to help; a country boy fighting the never-ending battle for truth and justice. And recent comics have truly spotlighted his role as the people’s hero: Following a neophyte Man of Steel still learning his powers’ limits, Superman fights the evil corporate tycoons and corrupt one-percenters that have overwhelmed the establishment. ","imgUrl":"http://vignette3.wikia.nocookie.net/superman/images/b/bc/Superman-injusticegodsamongus.png","id":"cf4427f0-4c1a-412a-9dcc-59215bb58e9f"},{"name":"The Flash","secretIdentity":"Barry Alen","bio":"\r\nIndy cars, bullet trains, supersonic aircraft… The Flash leaves them all in the dust.\r\n\r\nYoung Barry Allen’s life stopped the minute his mother was murdered. The true killer never found, its mystery obsessed Barry, driving him to become a forensic scientist. Consumed by his work, he spent his life chained to his desk, solving every case that flew across it. But when a freak lightning bolt hits a nearby shelf in his lab, Barry receives super-speed, becoming the Flash. Now, he’ll race up buildings, across oceans, and around the world to get his man—while getting introduced to a world so much bigger than his old life of microscopes and cold cases.\r\n\r\nAble to run at near light-speeds, his powers provide the ultimate caffeine kick: He can run up buildings, move so swiftly he phases through objects, create sonic booms with the snap of his fingers—and never need to order delivery. Despite his speed, Barry can become so obsessed with crime-solving he can still lose track of everything else around him, leaving the fastest man alive constantly running a minute behind.","imgUrl":"http://cdn1-www.craveonline.com/assets/uploads/2016/05/The-Flash-51-featured.jpg","id":"5d0ff3f9-0800-487b-9385-6e797d6d7eed"},{"name":"Green Lantern","secretIdentity":"Hal Jordan","bio":"Imagine if the ring on your finger was more than a piece of gaudy jewelry. Instead, it’s the universe’s most powerful weapon. It can create whatever you wish out of pure energy, its might limited only by your imagination and will. And with it comes exclusive membership to an exclusive intergalactic police force with alien officers spanning the cosmos.\r\n\r\nThe only catch? Mastering that power and being a Green Lantern means facing your fears, and for headstrong Hal Jordan, that’s something he’s been avoiding his whole life.When just a boy, Hal witnessed his greatest nightmare—his pilot father dying in a tragic plane crash. Nevertheless determined to follow in his footsteps, Hal repressed his fears, becoming a reckless, defiant test pilot. But when a dying alien crashes on Earth, the irresponsible Hal is chosen to be that alien’s successor in the Green Lantern Corps, a universe-wide peacekeeping force over 3,600 members strong.\r\n\r\nAnd his life only gets wilder from there. Alien romances. Intergalactic wars. Power-hungry super-villains. Wielding a Green Lantern power ring—a weapon fueled by willpower—he can fly and create constructs made of pure energy, generating anything from massive green fists to emerald rifles that can snipe from a planet away. But while Hal tends to ignore his fears, he’ll learn the only way to truly master his ring’s power is by confronting and overcoming them.","imgUrl":"https://static.comicvine.com/uploads/original/11123/111230211/4941845-5672237426-Green.jpg","id":"1353bd41-4fa6-4fd1-87cb-35a82a043b95"},{"name":"Cyborg","secretIdentity":"Victor Stone","bio":"Nowadays, everyone’s juggling an offline and online persona. But only one hero is a literal marriage of technology and man. Half human, half machine, Victor Stone is Cyborg, a digital and physical tank—and a true superhero for the modern age.\r\n\r\nAlthough a star athlete, Vic Stone only yearned for his father’s approval. But Dad was too focused on his scientific career to notice… until the day Vic became his greatest experiment. After Vic suffered a grave injury, his father saved him by replacing over half his body with cybernetic parts.\r\n\r\nNow Cyborg is plugged into every computer on Earth, and no firewall—or brick wall—can keep him out. While his cybernetic enhancements provide superhuman strength, speed, and endurance, that same technology destroys his chances to live as a professional athlete. Now flourishing in the digital realm, Vic is desperately alone in the physical world—and still longs for his father’s affection.  Hungry to find purpose again, he fights alongside the World’s Greatest Super Heroes.","imgUrl":"https://static.comicvine.com/uploads/original/7/74889/2697604-cyborg628.jpg","id":"5f843f53-b012-4d96-b74b-a7dd9b200c8c"},{"name":"Joker","secretIdentity":"Unknown","bio":"Don't make us laugh. The green hair. The crazed smile. The maniacal cackle. You know exactly who he is and how far he'd go to put a smile on your face.\r\n\r\nWhether by way of award-winning films like \"The Dark Knight,\" Emmy-winning animated programs like \"Batman: The Animated Series,\" video game appearances such as the record-breaking \"Batman: Arkham Asylum,\" or the countless comics stacking comic book shelves and digital libraries, the Joker stands unquestionably as the most recognizable and popular comic book villain in pop culture history. Unpredictable, violent and incredibly dangerous, he is chaos personified and has taken on everyone from his archenemy Batman to even the Man of Steel.\r\n\r\nBut Gotham remains his primary home and Batman his biggest adversary, and no hero is perhaps better suited as in many ways, the Joker is the polar opposite of the Dark Knight. Both were created by a great tragedy, but Batman has since vowed to do whatever it takes to prevent similar incidents, the Joker revels in creating chaos and destroying lives, believing that life’s a big joke and psychotically demonstrating that in a moment, it can all change.\r\n\r\nNot much is known about his past, but his acts during the present are what define the Joker as one of the greatest threats to our heroes and the people they've sworn to protect. He's killed a Robin, crippled Batgirl, and tortured and murdered countless people throughout the DC Universe—all just for a laugh.","imgUrl":"http://schmoesknow.com/wp-content/uploads/2014/11/the-joker.jpg","id":"52d6965f-eeb3-4499-95e3-74b8a499551b"},{"name":"Martial Manhunter","secretIdentity":"J'onn J'onzz","bio":"What are our best traits as humans? Our empathy? Our intelligence? Our respect for life and constantly striving to do right? It’s ironic, then, that within the DC Universe, very few people embody those very human traits quite as well as J’onn J’onzz, the Martian Manhunter.\r\n\r\nWhat are our best traits as humans? Our empathy? Our intelligence? Our respect for life and constantly striving to do right? It’s ironic, then, that within the DC Universe, very few people embody those very human traits quite as well as J’onn J’onzz, the Martian Manhunter.\r\n\r\nA former police officer and family man on his home planet of Mars, J’onn’s life was shaped by great tragedy after witnessing horrific fires that engulfed and destroyed his people and planet—leaving him the lone survivor of his race. Grieving for his family and world, J’onn made Earth his new residence, quickly becoming one of the universe’s most powerful protectors and a key asset for the JLA.\r\n\r\nPossessing a unique set of powers and abilities, Martian Manhunter rivals even Superman when it comes to his capabilities. Incredible strength, flight, shape-shifting, invisibility, telepathy, telekinesis, extensive wisdom, powerful optic blasts… Martian Manhunter is a force to be reckoned with. Yet for all of his power and wisdom, this near-immortal is still troubled by that which destroyed his world—fire. Though it continues to haunt him, he has learned to channel his fear and transform it into resilience, one of mankind’s greatest traits. Shaped by tragedy and driven by a desire to prevent his planet’s fate from happening to Earth, Martian Manhunter continues to prove that there’s much we can learn from this uniquely human hero.","imgUrl":"http://www.writeups.org/wp-content/uploads/Martian-Manhunter-DC-Comics-JSA.jpg","id":"6a4a75cc-21ce-4191-9099-a7e1750cacd8"},{"name":"Batgirl","secretIdentity":"Barbara Gordon","bio":"A prodigy ahead of her time? Check. Fought toe-to-toe with Gotham’s most unsavory? Double-check. Bailed out the Dark Knight on countless occasions? Capital C check.\r\n\r\nBatgirl is Barbara Gordon, a confident young woman as committed to justice as her father, Gotham City’s top cop Commissioner Gordon. But when her overprotective Dad forbids her from joining the force, her admiration of Batman leads her to rebel the way crime-fighting rebels do in Gotham City: by picking up the mantle of the Bat.\r\n\r\nAn exceptional fighter and detective, Batgirl is also unparalleled in her computer skills. With a Utility Belt filled with Batarangs and her own Batcycle to speed her across the city, she pursues justice regardless of whether others—including Batman—wish her to. But Gotham’s criminals are a ruthless and maniacal lot, and every moment she risks her neck means dancing closer to death.","imgUrl":"http://orig07.deviantart.net/ff5d/f/2014/283/8/8/batgirl_by_david_ocampo-d82amqs.jpg","id":"84cdb4f5-ced2-44b5-abad-b2a3d1e2d04d"},{"name":"Supergirl","secretIdentity":"Kara Danvers","bio":"A prodigy ahead of her time? Check. Fought toe-to-toe with Gotham’s most unsavory? Double-check. Bailed out the Dark Knight on countless occasions? Capital C check.\r\n\r\nBatgirl is Barbara Gordon, a confident young woman as committed to justice as her father, Gotham City’s top cop Commissioner Gordon. But when her overprotective Dad forbids her from joining the force, her admiration of Batman leads her to rebel the way crime-fighting rebels do in Gotham City: by picking up the mantle of the Bat.\r\n\r\nAn exceptional fighter and detective, Batgirl is also unparalleled in her computer skills. With a Utility Belt filled with Batarangs and her own Batcycle to speed her across the city, she pursues justice regardless of whether others—including Batman—wish her to. But Gotham’s criminals are a ruthless and maniacal lot, and every moment she risks her neck means dancing closer to death.","imgUrl":"http://www.dccomics.com/sites/default/files/GalleryChar_1900x900_supergirl_52ab8bf5245424.82657520.jpg","id":"a4a435b8-b25f-4e18-ac16-43ee499e256c"}]}